// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой конвертер двоичных чисел в десятичные
// binToDec.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <bitset>
using namespace std;

int main() {
    puts("Введите число в бинарном коде не более 255, например 10101010");
    string bin_number;
    getline(cin >> ws, bin_number);
    unsigned int number = bitset<8>(bin_number).to_ulong(); // <8> количество знаков
    cout << number << endl;
    return 0;
}
/* Output:
Введите число в бинарном коде не более 255, например 10101010
111
7
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
