// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой конвертер десятичных чисел в двоичные
// convDecToBin.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <bitset>
using namespace std;

int main() {
    puts("Введите натуральное число от 0 до 255");
    int dec = 0;
    cin >> ws >> dec;
    // <8> количество знаков
    string binary = bitset<8>(dec).to_string();
    cout << binary << "\n";
    return 0;
}
/* Output:
Введите натуральное число от 0 до 255
4
00000100
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
