// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример заполнения массива случайными числами
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
#include <ctime>
using namespace std;

int main() {
    srand(time(0)); // Инициализация генератора
    short arr[5]; // Объявили фиксированный массив
    for (int i = 1; i <= 5; ++i) {
        int secretNum = 1 + (rand() % 5);
        arr[i] = secretNum;
    }
    for (int i = 1; i <= 5; ++i) {
        cout << arr[i];
    }
    return 0;
}
// Output
/*
102030
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //