// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой генератор случайных чисел c условием и подсчётом попыток.
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <ctime>
using namespace std;

int main() {
    srand(static_cast<unsigned int>(time(0)));  // Запускаем генератор
    int count = 0;
    for (;;) {
        ++count;
        int secretNumber = (rand() % 15) + 0;  // Устанавливаем диапазон чисел
        cout << secretNumber << endl;
        if (secretNumber == 10) {
            cout << secretNumber << endl;
            cout << "Попыток: " << count << endl;
            exit(0);
        }
    }
    return 0;
}
// Output:
/*
2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//