// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Проверка знаний таблицы умножения
// chekMultiplicTable.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
/*#include <ctime> // функция time(), которая возвращает в качестве времени общее
// количество секунд, прошедшее от полуночи 1 января 1970 года*/
using namespace std;

int main() {
    srand(time(0));                   // Инициализация генератора
    cout << boolalpha;
    int one = 0;
    int two = 0;
    int min = 1, max = 9;
    one = rand() % (min - max + 1) + min; // Генерируем 1-е число
    two = rand() % (min - max + 1) + min; // Генерируем 2-е число
    int result = one * two;
    cout << one << " x " << two << endl;
    cout << "Введите ответ: ";
    int answer = 0;
    cin >> answer;
    cout << (result == answer ? true : false ) << endl;
    return 0;
}
// Output:
/*
6 x 3
Введите ответ: 12
false
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//