// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Программа в угадайку случайных чисел
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
//#include <cstdlib>
#include <ctime>
using namespace std;

int main() {
    srand(static_cast<unsigned int>(time(0)));  // Активация рандома
	int secretNumber = 1 + (rand() % 5);  // Генератор рандома от 1 до 10
	int tries = 0;
	int guess;
	cout << "\tУгадай моё число!\n\n";
	do	{
		cout << "Сделайте попытку: ";
		cin >> guess;
		++tries;

		if (guess > secretNumber) {
			cout << "Слишком большое!\n\n";
		}
		else if (guess < secretNumber) {
			cout << "Слишком маленькое!\n\n";
		}
		else {
			cout << "\nУгадал! Это стоило тебе " << tries << " попыток!\n";
		}

	} while (guess != secretNumber);

    return 0;
}
// Output:
/*
Сделайте попытку: 1
Слишком маленькое!

Сделайте попытку: 2

Угадал! Это стоило тебе 2 попыток!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
