//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Генератор паролей
// V 1.0
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include <iostream>
using namespace std;

int main() {
    srand(time(0));
    unsigned long password = 0;
    cout << "Программа генерации паролей\n";
    cout << "Введите диапазон пароля до 10-и значного, но не меее 3: ";
    char again = 'y';
    short range = 0;
    cin >> range;
    while (again == 'y') {
        if (range < 3) {
            cout << "Вы ввели < 3" << endl;
            main();
        }
        if (range > 10) {
            cout << "Вы ввели > 10" << endl;
            main();
        }
        for (int i = 0; i < range; ++i) {
            password = 0 + (rand() % 9);
            cout << password;
        }
        cout << "\nЖелаете получить ещё пароль? y или n: ";
        cin >> again;
    }
    return 0;
}
// Output
/*
Программа генерации паролей
Введите диапазон пароля до 10-и значного, но не меее 3: 10
7610417800
Желаете получить ещё пароль? y или n: y
4322253582
*/
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// End file
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
