//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Генератор симфольно-числовых паролей в диапазоне
// V 1.0
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include <iostream>
using namespace std;

int main() {
    //srand(time(0));
    // Заполнить пустой массив символами английского алфавита по порядку
    int arr[26];
    int count = 0;
    while (count < 26) {
        ++count;
        for (char abc = 'a'; abc <= 'z'; ++abc) {
            arr[count] = abc;
        }
        cout << (char)arr[count] << ' ';
    }

    return 0;
}
// Output
/*

*/
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// End file
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
