// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой генератор случайных чисел с помощью функции srand.
// rand.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
/*#include <ctime> // функция time(), которая возвращает в качестве времени общее
// количество секунд, прошедшее от полуночи 1 января 1970 года*/
using namespace std;

int main() {
    srand(time(0));                   // Инициализация генератора
    /* cout << 1 + (rand() % 5) << endl; // 1 и 5 - это диапазон генерируемых чисел
    // Начальное число в диапазоне 0 или 1
    int secretNum = 1 + (rand() % 5);
    cout << secretNum << endl; */
    int min = 3, max = 5;
    int secret = 0;
    secret = rand() % (max - min + 1) + min;
    cout << secret << endl;
    /* while (true) {
        secret = rand() % (max - min + 1) + min;
        cout << secret << endl;
        if (secret < min || secret > max) {
            cout << '\7';
            return 0;
        }
    } */
    return 0;
}
// Output:
/*
3
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//