// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример вычисления суммы значений элементов в
// простом массиве.
// calculate.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
  int sum = 0;
  int arr[] = {1, 10, 3, 5, 6};
  int LENGHT = sizeof(arr) / sizeof(*arr);
  for (int i = 0; i != LENGHT ; ++i) {
    sum += arr[i];
  }
  cout << sum << endl;
  /* int multi = 1; // Потому, что на 0 не умножают
  for (int i = 0; i != LENGHT ; ++i) {
    multi *= arr[i];
  }
  cout << multi << endl; */
  return 0;
}
// Д.З. Дописать эту программу так, что она ещё вычисляла произведение значений элементов массива
// Output
/*
25
900
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
