// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простое сравнение 2-х натуральных чисел
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << boolalpha;
    cout << "Программа сравнения 2-х натуральных чисел\n";
    cout << "Введите 1-е число: ";
    long firstNum = 0;
    cin >> firstNum;
    //cin.ignore(32767, '\n');
    cout << "Введите 2-е число: ";
    long secondNum = 0;
    cin >> secondNum;
    string equal = "1-е и 2-е числа равны", smal = "1-е < 2-го", lagre = "1-е > 2-го";
    if (firstNum == secondNum) {
        cout << equal << '\n';
    }
    else if (firstNum < secondNum) {
        cout << smal << '\n';
    }
    else {
        cout << lagre << '\n';
    }
    return 0;
}
// Output:
/*
Программа сравнения 2-х натуральных чисел
Введите 1-е число: 1
Введите 2-е число: 1
1-е и 2-е числа равны
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//