// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простое сравнение 2-х натуральных чисел
// equal.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << boolalpha;
    cout << "Программа сравнения 2-х натуральных чисел\n";
    cout << "Введите 1-е число: ";
    long fisrtNum = 0;
    cin >> fisrtNum;
    //cin.ignore(32767, '\n');
    cout << "Введите 2-е число: ";
    long secondNum = 0;
    cin >> secondNum;
    string equal = "1-е и 2-е числа равны", noEqual = "1-е и 2-е  числа не равны";
    //(fisrtNum == secondNum) ? (cout << "1-е и 2-е числа равны\n") : (cout << "1-е и 2-е  числа не равны\n");
    (fisrtNum == secondNum) ? (cout << equal << '\n') : (cout << noEqual << '\n');
    return 0;
}
// Output:
/*
Программа сравнения 2-х натуральных чисел
Введите 1-е число: 1
Введите 2-е число: 1
1-е и 2-е числа равны
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//