// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой способ обработки исключения
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << "Введите 1-е число: ";
    int firstNum{0};
    cin >> firstNum;
    cin.ignore(32767, '\n');
    if (!cin) {
        cerr << "!? Ошибка ввода - аварийный выход!\n";
        return -1;
    }
    cout << "Введённое вами 1-е число: " << firstNum << endl;
    cout << "Введите 2-е число: ";
    int secondNum{0};
    cin >> secondNum;
    cin.ignore(32767, '\n');
    if (!cin) {
        cerr << "!? Ошибка ввода - аварийный выход!\n";
        return -1;
    }
    cout << "Введённое вами 2-е число: " << secondNum << endl;

    return 0;
}
// Output:
/*
Enter first num: r
!? Ошибка ввода - аварийный выход!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//