// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример преинкремента.
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    cout << "Постинкремент: " << endl;
    int i = 0;
    cout << i++ << endl; // 0 = 0 + 0
    cout << i++ << endl; // 1 = 0 + 1
    cout << i++ << endl; // 2 = 1 + 1
    cout << i++ << endl;
    cout << i++ << endl;
    cout << i++ << endl;
    return 0;
}
// Output:
/*
Постинкремент:
0
1
2
3
4
5
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//