// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Программа нахождения больше или меньше установленного числа
// moreLessNum2.cpp IFELSE
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include<iostream>
using namespace std;

int main() {
    int x = 0;
    puts("Введите любое натуральное число");
    //(x <= 15) ? "<= 15" : ">= 15";
    cin >> ws >> x;
    if (x < 15) {
        puts("< 15");
    }
    if (x > 15) {
        puts("> 15");
    }
    if (x == 15) {
        puts("=15");
    }
    return 0;
}
// ДЗ:
// Output
/*
Введите любое натуральное число
89
>= 15
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-