// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Ещё простые if-ы
// moreIncompleteIf.cpp IFELSE
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    puts("Нажимай на клавиатуре любую букву, кроме 'a'!");
    char push;
    cin >> ws >> push;
    if ('a' != push) {
        main(); // Возвращаемся в начало Главной функции
    }
    if ('a' == push) {
        puts("\e[43;30m""Вы нажали 'a'!""\e[0m");
    }
    return 0;
}
// Output
/*
Нажимай на клавиатуре любую букву, кроме 'a'!
a
Вы нажали 'a'!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//