// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример цикла do...while
// doWhile.cpp DoWhile на эту программу есть блок-схема
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int counter = 0;
    do {
        ++counter;
        cout << counter << " - хотя бы один раз..." << "\n";
    } while (counter < 0);

    while (counter < 0) {
        ++counter;
        cout << counter << "\n";
    }
    return 0;
}
// Output:
/*
1 - хотя бы один раз...
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//