// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Ещё один пример цикла с постусловием
// multiTable.cpp DoWhile
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int n{0}, counter{0}, limit{0}; // Юниформ инициализация
    puts("Введите начальное значение");
    cin >> n;
    puts("Введите предельное значение");
    cin >> limit;
    do {
        cout << n << '*' << counter << '=' << n * counter << endl;
        ++counter;
    } while (counter <= limit);
    return 0;
}
//
// Output:
/*
Введите начальное значение
4
Введите предельное значение
10
4*0=0
4*1=4
4*2=8
4*3=12
4*4=16
4*5=20
4*6=24
4*7=28
4*8=32
4*9=36
4*10=40
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//