// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Вычисление суммы натуральных чисел
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int num = 0, sum = 0;
    cout << "Введите натуральное число: ";
    cin >> num;
    sum = num * (num + 1) / 2; // Если 12, то 1+2+3+4+5+6+7+8+9+10+11+12
    // Или 12 (12 +1) / 2= 12 (13) / 2 = (156) / 2 = 78
    cout << "Сумма натуральных чисел: " << sum << endl;

    return 0;
}
// Output:
/*
Введите натуральное число: 8
Сумма натуральных чисел: 36
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
