// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Массив и указатели. Тоже от Дарьи
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    cout << "Массив без указателя\n";
    int m[] {1, 2, 3, 4, 5, 6, 7, 8, 9};
    cout << m[0] << " = " << *(m + 0) << " = " << (&m + 0) << '\n'; // Получем 0-й индекс элемента массива
    cout << m[1] << " = " << *(m + 1) << " = " << (&m + 1) << '\n';
    cout << endl;
    cout << "Доступ к массиву с помощью указателей\n";
    int *p = m; // Создаём указатель на массив
    cout << *p << " = " << *m << " = " << (&m + 0) << '\n'; // Получаем 0-й индекс элемента массива
    cout << *(p + 1) << " = " << *(m + 1) << " = " << (&m + 1) << '\n'; // Получаем 1-й индекс эелемента ассива
    cout << *(p + 2) << " = " << *(m + 2) << " = " << (&m + 2) << '\n';
    return 0;
}
// Output
/*
Массив без указателя
1 = 1 = 0x7fff1fe02250
2 = 2 = 0x7fff1fe02274

Доступ к массиву с помощью указателей
1 = 1 = 0x7fff1fe02250
2 = 2 = 0x7fff1fe02274
3 = 3 = 0x7fff1fe02298
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //