// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Фиксированные массивы. Реверс
// sortFixArr.cpp в папке Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    puts("Реверс значений массива 1-й способ");
    int array[] = {1, 2, 3, 4, 5};
    const int SIZE = sizeof(array) / sizeof(*array);
    int k = 0, reverse[SIZE];
    for (int i = SIZE - 1; i >= 0; --i) { // - 1, потому, что нам нужен последний индекс саммива
        reverse[k] = array[i];
        ++k;
    }
    for (auto i : reverse) {
        cout << i;
    }
    cout << endl;
    puts("Реверс значений массива 2-й способ");
    return 0;
}
/* Output:
5 4 3 2 1
54321
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //