// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Массивы. Начало.
// baseArr.cpp в папке Arrays
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;
// 1,0,100,25,3 - коллекция
// {0, 1, 2} - счёт начинается с нуля
int main() {
    short arr[3]; // Объявили фиксированный массив
    arr[0] = {10}; //
    arr[1] = {20};
    arr[2] = {30};
    cout << arr[0] << ' ' << arr[1] << ' ' << arr[2] << endl;
    // Подсчитать количество элементов в массиве
    int arrCount = sizeof(arr) / sizeof(arr[0]);
    cout << "Количество элементов в массиве arr: " << arrCount << endl;
    // Размер массива в байтах
    int arrSize = sizeof(arr);
    cout << "Размер массива в байтах: " << arrSize << endl;
    const short ARR_INDEX[] = {5, 4, 3, -2, 1};
    for (auto i = 0; i <= 4; ++i) {
        cout << ARR_INDEX[i] << ' ';
    }
    cout << endl;
    for (auto i : ARR_INDEX) { // Специальная форма For для массивов
        cout << i << ' ';
    }
    cout << endl;
    // Заполнение массива с помощью цикла
    int newArr[5];
    for (int a = 0; a <= 4; ++a) {
        newArr[a] = a + 2;
    }
    for (auto i : newArr) {
        cout << i << ' ';
    }
    cout << endl;
    return 0;
}
// Output
/*
10 20 30
Количество элементов в массиве arr: 3
Размер массива в байтах: 6
5 4 3 -2 1
5 4 3 -2 1
2 3 4 5 6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
