// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример заполнения простого массива случайными числами
// fillArrRand.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    srand(time(0)); // Запускаем генератор
    int arr[5] = {0};
    int secretNumber;
    for (int i = 0; i != 5; ++i) {
        secretNumber = (rand() % 15);      // Устанавливаем диапазон чисел
        arr[i] = secretNumber; // Заполняем массив рандомными числами
    }
    puts("\nСодержимое массива arr: ");
    for (int s = 0; s != 5; ++s) {
        cout << arr[s] <<  " ";
    }
    cout << '\n';
    return 0;
}
// Output:
/*
14 6 4 7 12
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
