// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Пример базовых операций с вещественными числами в фиксированными
// одномерными массивами
// floatAndDoubleArr.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <iostream>
using namespace std;

int main() {
    puts("Массив вещественных чисел");
    const int SIZE = 4; // Размер будущего массива
    float farr[SIZE] {0}; // Заполняем элементы массива нулями
    float ff = 0;
    for (int f = 0; f != SIZE; ++f) { // Показать ребятам cppcheck <=
       cout << (farr[f] = {ff += 0.1}) << ' ';
    }
    cout << '\n';
    double darr[SIZE];
    double dd = 0;
    for (int d = 0; d != SIZE; ++d) {
        cout << showpoint << (darr[d] = {dd -= 1}) << ' ';
    }
    cout << '\n';
    return 0;
}
// Output
/*
Массив вещественных чисел
0.1 0.2 0.3 0.4
-1.00000 -2.00000 -3.00000 -4.00000
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
