// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Пример итерации по вектору. Что это?
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <iostream>
using namespace std;

int main() {
  // int arr[7];                // Хорошо!
  // const int ARRAY_WIDTH = 5; // Хорошо
  // int arr[ARRAY_WIDTH];          // Хорошо
  enum { MIN_ARR_WIDTH = 5 };
  int arr[MIN_ARR_WIDTH]; // Хорошо
  cout << sizeof(arr) / sizeof(arr[0]) << endl;
  /*
  // Плохой вариант
  int width = 0;
  cin >> width;
  int arr(width);

  // Ещё плохой вариант
  int temp = 8;
  const int A = temp;
  int arr[A];
  */
  return 0;
}

// Output
/*
5
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
