// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Поиск дубликатов в массиве с числами
// findDublicInArr.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int arr[] {4, 7, 8, 8, 6, 5, 6, 4, 6, 8};
    const int LENGHT = sizeof(arr) / sizeof(*arr);
    int find = 0;
    for (int i = 0; i < LENGHT; ++i) {
        for (int k = i + 1; k != LENGHT; ++k) {
            if (arr[i] == arr[k]) {
                for (int n = k - 1; n >= 0; --n) {
                    if (arr[k] == arr[n]) {
                        ++find;
                    }
                }
                if (find == 1) {
                    cout << arr[i] << ' ';
                }
                find = 0;
            }
        }
    }
    cout << endl;
    return 0;
}
// Д.З. На основе этой программы сделать рандомное заполнение массива и поиск в нём дубликатов
// OUTPUT // Возможный результат:
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //