// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Как можно и нельзя с многомерными массивами
// mayCannot.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    //int a[] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя!
    //int a[4][6] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}, {10, 9, 8}, {11, 12, 13, 14, 15, 16, 17}}; // Так тоже нельзя!
    //int a[0][5] {{1, 2, 3, 4, 5}, {5, 5, 3, 2, 1}}; // Так нельзя
    //int a[3][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Допустимо
    //int a[][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Допустимо
    //int a[][] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя
    //int threeArr[][2][3] {{{1, 2, 3}}, {{5, 4, 3}}, {{3, 9, 9}}}; // Допустимо
    int arr[][8] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1, 0, -1, -2}, {18}, {15}};
    cout << arr << endl; // Адрес массива в памяти
    cout << arr[0][0] << endl;
    cout << arr[1][6] << endl;
    cout << arr[2][0] << endl;
    cout << arr[3][0] << endl;
    //cout << arr[5][12] << endl;
    cout << "Арифметика многомерного массива\n";
    cout << "arr[0][1] + arr[0][2] = " << arr[0][1] + arr[0][2] << endl;
    cout << "arr[0][1] + arr[1][3] = " << arr[0][1] + arr[1][3] << endl;
    cout << "arr[0][1] + arr[2][0] = " << arr[0][1] + arr[2][0] << endl;
    int threeArr[][5][4] {{{1, 2, 0, -1}}, {{20, 10, 50}}, {{30, 40, 60}}, {{33, 44, 70}}, {{31, 41, 11}}};
    cout << threeArr[0][1][0] << endl;
    return 0;
}
//
// OUTPUT // Возможный результат:
/*
0x7ffd11fd8110
1
-1
18
15
Арифметика многомерного массива
arr[0][1] + arr[0][2] = 5
arr[0][1] + arr[1][3] = 4
arr[0][1] + arr[2][0] = 20
0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //