// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Эмодзи и кириллица в char-массивах
// emorus.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <iostream>
using namespace std;

int main() {
    char emo[] {"🚑🚿☔"};
    cout << emo << endl;
    char rus[] {"Русский"};
    cout << rus << " размер: " << sizeof(rus) << " байт "
         << " тип: " << typeid(rus).name() << endl;
    // char moreRus[] {'Р', 'у'};
    // char - это 1 байт, а каждый символ кириллицы - это 2 байта
    return 0;
}
//
// Output
/*
🚑🚿☔
Русский размер: 15 байт  тип: A15_c
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
