// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Как можно и нельзя с многомерными массивами
// mayCannot.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    //int a[] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя!
    //int a[4][6] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}, {10, 9, 8}, {11, 12, 13, 14, 15, 16, 17}}; // Так тоже нельзя!
    //int a[0][5] {{1, 2, 3, 4, 5}, {5, 5, 3, 2, 1}}; // Так нельзя
    //int a[3][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Допустимо
    //int a[][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Допустимо
    //int a[][] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя
    //int threeArr[][2][3] {{{1, 2, 3}}, {{5, 4, 3}}, {{3, 9, 9}}}; // Допустимо
    int arr[][8] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1, 0, -1, -2}, {18}, {15}};
    cout << arr << endl; // Адрес массива в памяти
    cout << arr[0][0] << endl;
    cout << arr[1][6] << endl;
    cout << arr[2][0] << endl;
    cout << arr[3][0] << endl;
    //cout << arr[5][12] << endl;
    cout << "Арифметика многомерного массива\n";
    cout << "arr[0][1] + arr[0][2] = " << arr[0][1] + arr[0][2] << endl;
    cout << "arr[0][1] + arr[1][3] = " << arr[0][1] + arr[1][3] << endl;
    cout << "arr[0][1] + arr[2][0] = " << arr[0][1] + arr[2][0] << endl;
    int threeArr[][5][4] {{{1, 2, 0, -1}}, {{20, 10, 50}}, {{30, 40, 60}}, {{33, 44, 70}}, {{31, 41, 11}}};
    cout << "[0][0][0] - " << threeArr[0][0][0] << endl; // 1
    cout << "[0][0][0] - " << threeArr[0][0][1] << endl; // 0
    cout << "[0][0][2] - " << threeArr[0][0][2] << endl; // 2
    cout << "[0][0][2] - " << threeArr[0][0][2] << endl; // 2. 1-й подмассив, 1-й столбец, 4-й ряд
    cout << "[2][0][2] - " << threeArr[2][0][2] << endl; // 3-й подмассив, 1-й столбец, 1-й ряд
    cout << "[2][0][0] - " << threeArr[2][0][0] << endl; // 30
    cout << "[3][0][2] - " << threeArr[3][0][2] << endl; // 70
    cout << "[4][0][0] - " << threeArr[4][0][2] << endl; // 11
    /* cout << "[1][0][0] - " << threeArr[1][0][0] << endl; // 20. 2-й подмассив, 1-й столбец, 1-й ряд
    cout << "[2][0][0] - " << threeArr[2][0][0] << endl; // 30
    cout << "[2][0][1] - " << threeArr[2][0][1] << endl; // 40
    cout << "[2][0][2] - " << threeArr[2][0][2] << endl; // 60 */
    return 0;
}
//
// OUTPUT // Возможный результат:
/*
0x7ffe39d9bbe0
1
-1
18
15
Арифметика многомерного массива
arr[0][1] + arr[0][2] = 5
arr[0][1] + arr[1][3] = 4
arr[0][1] + arr[2][0] = 20
[0][0][0] - 1
[0][0][0] - 2
[0][0][2] - 0
[0][0][2] - 0
[2][0][2] - 60
[2][0][0] - 30
[3][0][2] - 70
[4][0][0] - 11
0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //