// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Стек и Куча в примере
// stackAndHeap.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int size = 0;
    cin >> size;
    // Плохой код
    /* int data[size][size];
    data[0][0] = 1; */
    // Какой-то код
    vector< vector<int> > vec(size, vector<int>(size));
    vec [0][0] = 1;
    return 0;
}
// ДЗ -
// Output
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//