// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Заполнить 0-ми фиксированный массив
// zerosArr.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include <iostream>

using namespace std;

int main() {
  int arr[10];
  cout << "Массив до заполнения 0-ми: ";
  for (auto i : arr) {
    cout << ' ' << i;
  }
  for (int i = 0; i < 10; ++i) {
    arr[i] = 0;
  }
  cout << "\nМассив после 0-ми: ";
  for (auto i : arr) {
    cout << ' ' << i;
  }
  cout << endl;
  return 0;
}
// Output
/*
Массив до заполнения 0-ми:  281699048 32698 4199264 0 0 0 4198656 0 -336399152 32767
Массив после 0-ми:  0 0 0 0 0 0 0 0 0 0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-