// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Массив символов
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <cstring> // Библиотека для strlen
using namespace std;

int main() {
    const char str[] = "Hello"; // Строка символов
    cout << str << endl;
    cout << str[2] << endl;
    cout << "Без нулевого символа: " << strlen(str) << '\n'
         << "С нулевым символом:: " << sizeof(str) << endl;
    return 0;
}
// Output:
/*
Hello
l
С нулевым символом: 5
Без нулевого символа: 6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
