// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Примеры решения математических задач на C++
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << "Найти среднее арифметическое" << "\n";
    int result = 0, firstNum = 0, secondNum = 0, thirdNum = 0;
    cout << "Введите три натуральных числа: ";
    cin >> firstNum >> secondNum >> thirdNum;
    result = (firstNum + secondNum + thirdNum) / 3;
    cout << "Среднее арифметическое: " << result << "\n";

    

    return 0;
}
// Output:
/*
Найти среднее арифметическое
Введите три натуральных числа: 25
35
55
Среднее арифметическое: 38
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//