#include <iostream> // Стандартная библиотека C++
using namespace std; // Просранство имён

// Некоторые управляющие символы
// CLI - командная строка
// GUI - графический интерфейс

int main() { // Главная функция
    /* cout << "Управляющие символы c++\n";
    cout << '\n' << '\n' << '\n' << '\n';
    // '' - символы
    // "" - строки
    cout << "Текст без новой строки";
    cout << "\nОператор звукового сигнала\a";
    cout << "\n\tСимвол горизонтального таба";
    cout << "\vСимвол вертикального таба\n"; */
    cout<<"Александр Блок написал свои первые стихи еще до гимназии.14 лет он издавал рукописный журнал - Вестник";
    cout<<"\nНочь, улица, фонарь, аптека,";
    cout<<"\n\tБессмысленный и тусклый свет.";
    cout<<"\nЖиви еще хоть четверть века —";
    cout<<"\n\tВсё будет так. Исхода нет.";
    cout<<"\n\vВсё будет так. Исхода нет.      Аптека, улица, фонарь.";
    return 0;
}