// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Определеить минуты и часы по количеству секунд
// findMinHour.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {      // Главная функция программы
    auto sec = 0;
    puts("Введите количество секунд");
    cin >> ws >> sec; // полное количество секунд
    int timeSecs = (sec % 3600) % 60; // секунды
    int timeMins = (sec % 3600) / 60; // минуты
    int timeHours = (sec / 3600);     // часы
    cout << "Сек. " << "Мин. " << "Час." << endl;
    cout << timeSecs << " : " << timeMins << " : " << timeHours << endl;
    return 0;
}
// Д.З.
// Output:
/*
Введите количество секунд
36464
Сек. Мин. Час.
44 : 7 : 10
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//