// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Задержка в C++. Числа
// incDelay.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
    int i = 0;
    cout         << ++i << ' ';
    sleep(1);
    cout.flush() << ++i << ' ';
    sleep(1);
    cout.flush() << ++i << ' ';
    sleep(1);
    cout << '\n';
    return 0;
}
// Д.З. На основе этой программы сделать новую, но с обратным отсчётом через декремент
// Output:
/*
1 2 3
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//