// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Тернарный оператор. Найти максимальное число из 2-х
// findMaxNum.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

/*
Синтаксис тернаного оператора
Условие ? 1-е действие : 2-е действие
*/

int main() { // Главная функция программы
    int x = 36, y = 44;
    cout << ((x > y) ? x : y) << endl;
    return 0;
}
// Д.З. На основе этой программы создать другую, которая находит наименьшее их 2-х
// Output:
/*
44
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
