// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// cin для беззнакового типа
// cinUnsigned.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int signedVar = -10; // short, int, long - для натуральных чисел
    cout << "Значение переменной signedVar: " << signedVar << endl;
    unsigned uVar = 10;
    cout << "Значение беззнакового типа данных: " << uVar << endl;
    cout << "Введите любое целое беззнаковое число: ";
    cin >> uVar;
    cout << "Вы ввели: " << uVar << endl;
    return 0;
}
// Output:
/*
Значение переменной signedVar: -10
Значение беззнакового типа данных: 10
Введите любое целое беззнаковое число: 6.8
Вы ввели: 6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//