// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Арифметика с присваиванием
// ari.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <iomanip>
using namespace std;

int main() {
    int a = 5;
    int b = 2;
    float c = 5.0;
    float d = 2.0;
    /*
       short - короткий, int - средний, long - большой,
       float - веществ.числа малой точности, double - веществ.числа высокой
       точности, char - символы, string - строки
    */
    cout << (a + b) << endl;
    cout << (a += b) << endl; // Сложение с присваиванием a = a + b
    cout << (a -= b) << endl; // Вычитание с присваиванием a = a - b
    cout << (a *= b) << endl; // Умножение с присваиванием
    cout << (c /= d) << endl; // Деление с присваиванием
    double dd = 2.0 / 35.3;
    cout << setprecision(5) << dd << endl;
    cout << "-=-=-=-=-=-=-=-=-=-" << endl;
    int n = -1;
    cout << showpos << (n - -2) << endl;
    return 0;
}
// Output:
/*
7
7
5
10
2.5
0.056657
-=-=-=-=-=-=-=-=-=-
+1
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//