// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Задержка в C++. Символы
// charDelay.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
    cout << '*' << ' ';
    sleep(1);
    cout.flush() << '*' << ' ';
    sleep(1);
    cout.flush() << '*' << ' ';
    sleep(1);
    cout << '\n';
    return 0;
}
// Д.З. На основе этой программы сделать обратный отсчёт от 5.
// Output:
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//