// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простые примеры с переменными
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
#include<iostream>
using namespace std;

int main() {
	auto n = 9'223'372'036'854'775'807;
	auto w = 446'744'073'709'551'615;
	//auto ar = "Hello"; // Нелья так делать!
	char a = 'a';
	char b = 'b';
	char str1[] = {"Привет!"};
	char str2[] = {" Алекс!"};
	string str3 = " Новый год!";
	string str4 = " Счастливый";
	cout << str1 << str2 << str3 + str4 << endl;
	cout << a + b << endl;
	cout << "Auto type: " << n << w << endl;
	cout << "Auto type: " << w << endl;
	cout << typeid(n).name() << '\n'; // Определение типа объекта
	return 0;
}
// Output:
/*
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//