// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Программа, определяющаяя название химического элемента
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << "\nВведите количество протонов\n";
    int userChoice = 0;
    cin >> userChoice;
    switch (userChoice)
    {
        case 1:
            cout << "Это Водород\n";
            break;
        case 2:
            cout << "Это Гелий\n";
            break;
        case 3:
            cout << "Литий\n";
            break;
        default:
            cout << "Такой элемент я ещё не знаю!\n";
            break;
    }
    return 0;
}
// Output:
/*
Введите количество протонов
2
Это Гелий
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
