// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой конвертер десятичных чисел в двоичные
// Пример проверки входных чисел, являются ли они
// больше чисел, умноженных на 2 (т.е. 1, 2, 4, 8, 16
// 32, 64, 128)
// convDecToBin.cpp
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main()
{
    cout << "Введите число от 0 до 255: ";
    int n = 2;
    cin >> n;
    if (n / 2 != 0) {
        cout << n / 2;
    }
    cout << n % 2;
    cout << endl;
    return 0;
}
/* Output:

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
