// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример нахождения большего из 3-х чисел
// findLanrgestNum.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    puts("Найти наибольшее из 3-х чисел");
    puts("Введите через пробел 3-и числа по очереди");
    int a = 0, b = 0, c = 0, max = 0;
    cin >> ws >> a >> ws >> b >> ws >> c;
    if (a > b) {
        if (a > c) {
            max = a;
        }
        else {
            max = c;
        }
    }
    else {
        if (b > c) {
            max = b;
        }
        else {
            max = c;
        }
    }
    cout << "max: " << max << endl;
    return 0;
}
// Д.З.
// Output:
/*
Найти наибольшее из 3-х чисел
Введите через пробел 3-и числа по очереди
0 0 0
max: 0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
