//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
// Факториалом числа называют произведение всех натуральных чисел до него
// включительно. Например, факториал числа 5 равен произведению 1 * 2 * 3 * 4 * 5 = 120.
// V 1.0
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
#include<iostream>
using namespace std;

int factorial(int n) {
    int f = 1;     // Начальное число
    while (n > 1) {
        f *= n;
        n -= 1;
    }
    return f;
}

int main() {
    cout << factorial(5) << endl;
    cout << factorial(6) << endl;
    return 0;
}
// Output
/*
120
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//