<<<<<<< HEAD
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Цикл с завершением по Break
// WhileIfBreak.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include<iostream>
using namespace std;

int main() {
    while (true) { // Бесконечный цикл
        cout << "Введите 0 для завершения цикла: ";
        int userNum;
        cin >> userNum;
        if (userNum == 0) {
            break;
        }
    }
    cout << "Выход!" << '\n';
    return 0;
}
// Output:
/*
Введите 0 для завершения цикла: 8
Введите 0 для завершения цикла: 8
Введите 0 для завершения цикла: 9
Введите 0 для завершения цикла: 9
Введите 0 для завершения цикла: 0
Выход!
=======
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
//
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {

	return 0;
}
// Output:
/*

>>>>>>> 5c30efefc1804c1de10273ca64ba66336c1362b6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
