// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Алгоритм продолжения или завершения игры
// retry.cpp While
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    char retry = 'y';
    while (retry == 'y') {
        puts("Вы отлично поиграли, желаете повторить? (y/n)");
        cin >> retry;
    }
    puts("Ok, bye!");
    return 0;
}
// Д.З.
// Output:
/*
Вы отлично поиграли, желаете повторить? (y/n)
y
Вы отлично поиграли, желаете повторить? (y/n)
i
Ok, bye
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//