// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Викторина с подсчётом баллов
// vict.cpp While
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    puts("Викторина вопросов");
    char again = 'y';
    short trutCount = 0;
    while (again == 'y') {
        puts("Можно ли выучить C++ за один часовой видеоролик? 0 - нет, 1 - да");
        bool userChoice = false;
        cin >> userChoice;

    }
    return 0;
}
// Output:
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
