// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Второй пример вложенного цикла. Полупирамидка из чисел.
// 2nestedLoop.cpp pyramid.dia
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int outer = 5;
    while (outer >= 1) {
        int inner = outer;
        while (inner >= 1) {
            cout << inner << ' ';
            --inner;
        }
        cout << '\n';
        --outer;
    }
    return 0;
}
// Output:
/*
5 4 3 2 1
4 3 2 1
3 2 1
2 1
1
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//