// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой обратный таймер минут и секунд
// reverseTimer.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
	int min = 0;
	cout << "Введите минуты: ";
	cin >> min;
	int sec = 60;
	while (min > 0) {
		int count = min;
		--min;
		while (sec >= 1) {
			cout << --sec << " : " << min << '\n';
			--count;
			sleep(1);
		}
		sec = 60;
		//cout << min << '\n';
	}
	return 0;
}
// Output:
/*
9 : 0
8 : 0
7 : 0
6 : 0
5 : 0
4 : 0
3 : 0
2 : 0
1 : 0
0 : 0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//