// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Сумматор
// summator.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
	int sum = 0, value = 0;
	while (cin >> value) {
        sum += value; // Тоже самое, что и sum = sum + value
	    cout << "Сума равна: " << sum << endl;
        if (value == 0) { // Завершение программы по условию
            break;
        }
    }
    	return 0;
}
// Output
/*
Сума равна: 4
2
Сума равна: 6
0
Сума равна: 6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//