// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Английский алфавит
// while.cpp While
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
    char en = 'a';
    while (en <= 'z') {
        cout << en << ' ';
        ++en;
    }
    cout << endl;
    /* en = 'a';
    while (en <= 'z') {
        sleep(1);
        cout << en << ' ';
        ++en;
        cout.flush();
    }
    cout << endl; */
    return 0;
}
// Д.З. Сделать программу вывода анг.алфавита с задержкой 1 сек. в строку
// Output:
/*
a b c d e f g h i j k l m n o p q r s t u v w x y z
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//