// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Операции с членами структуры
// Struct ariCom.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

struct Employee // Сотрудник
{
    string name;
    short id;
    int age;
    double salary;
};

int main() {
    // Инициализируем члены структуры
    Employee ivan {"Ivan", 0, 27, 75353.17};
    Employee petr {"Petr", 1, 30, 64464.35};
    Employee igor {"Igor", 2, 30, 61456.92};
    // Выводим значения структурных объектов
    cout << "Имя: " << ivan.name << endl;
    cout << "ID: " << ivan.id << endl;
    cout << "Возраст: " << ivan.age << endl;
    cout << "Зарплата: " << ivan.salary << endl;
    return 0;
}
// Задание
/*
Имя: Ivan
ID: 0
Возраст: 27
Зарплата: 75353.2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //