// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример проверки нахождения большего числа.
// TwoNumLargest.cpp IFELSE
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int x = 0, y = 0, largest = 0;
    puts("Введите через пробел 2 натуральных числа");
    cin >> ws >> x >> ws >> y;
    //largest = (x > y) ? x : y;
    if (x > y) {
        largest = x;
    }
    else if (x < y) {
        largest = y;
    }
    else { // x == y
        puts("Числа равны");
        exit(0);
    }
    cout << "Наибольшее число: " << largest << endl;
    return 0;
}
// ДЗ -
// Output
/*
Введите через пробел 2 натуральных числа
4 4
Числа равны
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//