// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Программа нахождения больше или меньше установленного числа
// moreLessNum.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int x = 0;
    cout << "Введите натуральное число: ";
    cin >> ws >> x;
    cout << ((x <= 15) ? "<= 15" : ">= 15") << endl;
    /* if (x < 15) {
        cout << "< 15" << endl;
    }
    else { // (x > 15)
        cout << "> 15" << endl;
    } */

    return 0;
}
// Output
/*
Введите натуральное число: 20
=> 15
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//