// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Программа нахождения больше или меньше установленного числа
// moreLessNum.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int x = 0;
    puts("Введите любое натуральное число: ");
    cin >> ws >> x;
    if (x > 15)
        puts("x > 15");
    if (x < 15) {
        puts("x < 15");
    }
    if (x == 15) {
        puts("x = 15");
    }
    //cout << ((x <= 15) ? "<= 15" : ">= 15") << endl;
    return 0;
}
// Output
/*
Введите натуральное число: 20
=> 15
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//