// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Проверка корректности ввода логина и пароля
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <string>
using namespace std;

int main() {
    cout << "Введите логин" << endl;
    string login = "user";
    string username;
    cin >> username;
    cout << "Введите пароль: ";
    int password;
    cin >> password;
    if (username == login && password == 123) {
        cout << "Вам разрешен доступ" << "\n";
    }
    else {
        cout << "Доступ запрещён!" << "\n";
    }

    return 0;
}
// Output:
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//