// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Наипростейший арифметический калькулятор с if-else-ми
// ifElseCalc.cpp IFELSE
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    cout << "Простой арифметический калькулятор" << endl;
    cout << "Введите числа: ";
    double firstNum = 0.0, secondNum = 0.0, result = 0.0;
    char op;
    cin >> firstNum >> op >> secondNum;
    cout << "Введите символ операции" << endl;
    if (op == '+') {
        result = firstNum + secondNum;
    }
    else if (op == '-') {
        result = firstNum - secondNum;
    }
    else if (op == '*') {
        result = firstNum * secondNum;
    }
    else if (op == '/') {
        result = firstNum / secondNum;
    }
    else {
        cout << "Введите правильный символ - +, -, *, /!" << endl;
        return main();
    }
    cout << "Результат вычисления: " << result << "\n";

    return 0;
}
// Д.З. Дописать программу, введя в ней деление, деление по модулю и умножение!
// Output:
/*
Простой арифметичкский калькулятор
Введите первое число: 2
Введите символ операции
+
Введите второе число: 2
Результат вычисления: 4
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//