// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Самый простой if
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    cout << "Угадайте правильный символ: ";
    char sim;
    cin >> sim;
    if (sim == 'a') {
        cout << "Ура! Вы угадали!!! Поздравляю!\n";
        exit(0);
    }
    cout << "Увы, вы не угадали(\n";
    return 0;
}
// Output
/*
Угадайте правильный символ: b
Увы, вы не угадали(
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//