// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Самый простой if
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    cout << "\e[43;31mУгадайте правильную букву: \e[0m";
    char sim;
    cin >> sim;
    if (sim == 'a') {
        cout << "\e[47;30mУра! Вы угадали!!! Поздравляю!\e[0m\n";
        exit(0);
    }
    cout << "\e[47;34mУвы, вы не угадали(\e[0m\n";
    return 0;
}
// Output
/*
Угадайте правильный символ: b
Увы, вы не угадали(
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//