// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Самый простой if по картинке неполного if
// simplyIf.cpp IFELSE
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int M = 0, a = 6, b = 5;
    M = a;
    if (b > a) { // Если истинно
        M = b;
    }
    cout << "\e[47;35m" << M << "\e[0m" << endl;
    cout << "Угадай правильную букву\n";
    char sim;
    cin >> ws >> sim;
    if (sim == 'a') {
        cout << "Ура! Вы угадали!" << endl;
        exit(0);
    }
    cout << "Увы, вы не угадали!" << endl;
    return 0;
}
// Output
/*
6
Угадай правильную букву
a
Ура! Вы угадали!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//