// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Поиск подстроки в строке
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    string phrase = "I am programmer";
    cout << "Поиск подстроки в строке:\n";
    if (phrase.find("n") == string::npos) {
        cout << "Не найдено!\n";
    }
    else {
        cout << "Есть такая подстрока!\n";
    }
    return 0;
}
/* Output:
Поиск подстроки в строке:
Есть такой символ!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
/* size_t substring_length = arr[i].find(findWord);
        if (substring_length == 0) {
          cout << "Не найдено слово " << findWord;
          break;
         }
        else {
          cout << "Найдено слово " << findWord;
          break;
        } */