// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример счётчика с перечислением символов английского алфавита.
// abc.cpp FOR
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    puts("Английский алфавит");
    for (char abc = 'a'; abc <= 'z'; ++abc) {
        cout << abc << ' ';
    }
    cout << '\n';
    puts("По таблице ASCII");
    for (int abc = 97; abc <= 122; ++abc) {
        cout << (char)abc << ' ';
    }
    cout << '\n';
    puts("С порядковой нумерацией");
    for (char abc = 'a'; abc <= 'z'; ++abc) {
        static int s_counter = 0;
        ++s_counter;
        cout << '#' << s_counter << ' ' << abc << ' ';
    }
    cout << '\n';
    /* puts("Английский алфавит в обратном порядке");
    for (char abc = 'z'; abc >= 'a'; --abc) {
        cout << abc << ' ';
    }
    cout << '\n'; */
    return 0;
}
// ДЗ. Добавить к этой программе обратный вывод английского алфавита
// Output:
/*
Английский алфавит
a b c d e f g h i j k l m n o p q r s t u v w x y z
С порядковой нумерацией
#1 a #2 b #3 c #4 d #5 e #6 f #7 g #8 h #9 i #10 j #11 k #12 l #13 m #14 n #15 o #16 p #17 q #18 r #19 s #20 t #21 u #22 v #23 w #24 x #25 y #26 z
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//