// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Игра "Угадай букву!". Пример использования оператора break в бесконечном цикле
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>

int main() {
    using namespace std;
    int count = 0;
    cout << "Угадай букву!" << endl;
    int con = 0;
    // Выводим английские буквы в алфавитном порядке
    // в столбик по 13 букв
    for (char ch = 'a'; ch <= 'z'; ++ch) {
        if (con % 4 == 0) {
            cout << "\n";
        }
        ++con;
        cout << ch << " ";
    }

    for (;;) {
        cout << "\nВведите букву из: ";
        char sm;
        cin >> sm;
        if (sm == 'e') {
            break;
        }
        ++count;
        cout << sm << "\tИтерация: " << count << endl; // Номер попытки
        cout << "Попробуй снова!" << endl;
    }
    cout << "Сумма неудачных итераций: " << count << endl; // Сумма попыток

    return 0;
}
// Output:
/*
Угадай букву!
a b c d e f g h i j k l
m n o p q r s t u v w x y
z
Введите букву: d
dИтерацтя: 1
Попробуй снова!

Введите букву: e
Сумма итераций: 1
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
