// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример использования цикла for с оператором break
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int num = 0;
    for (num = 0; num <= 5; ++num) {
        cout << "num: " << num << endl;
        if (num == 3) { break; } // Прерывание цикла
        // Прыжок из цикла
    }
    cout << "Прерванный цикл на: " << num << endl;
    return 0;
}
// Output:
/*
num: 0
num: 1
num: 2
num: 3
Прерванный цикл на: 3
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
