// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Игра на угадывания буквы
// guessLetter.cpp For
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int counter = 0;
    puts("Угадай букву!");
    int col = 0;
    // Выводим на экран английский алфавит в столбик в 4 столбца
    for (char abc = 'a'; abc <= 'z'; ++abc) {
        if (col % 4 == 0) {
            cout << endl;
        }
        ++col;
        cout << abc << ' ';
    }
    for (;;) {
        cout << "\nВведите букву ";
        char sm;
        cin >> sm;
        if (sm == 'e') {
            break; // Прыжок из цикла
        }
        ++counter;
        cout << sm << "\tИтерация: " << counter << endl;
        cout << "Попробуйте снова!";
    }
    cout << "Угадал! Сумма неудачных итераций: " << counter << endl;
    return 0;
}
// Output:
/*
a b c d
e f g h
i j k l
m n o p
q r s t
u v w x
y z
Введите букву 6
6       Итерация: 1
Попробуйте снова!
Введите букву 8
8       Итерация: 2
Попробуйте снова!
Введите букву e
Угадал! Сумма неудачных итераций: 2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
