// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Демонстрация работы счётчиков for
// for.cpp FOR
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
	// (начало; цель; шаг)
	puts("Счёт вперёд до 9");
	for (int i = 0; i < 10; ++i) {
		cout << i << ' ';
	}
	cout << endl;
	for (int i = 0; i != 10; ++i) {
		cout << i << endl;
	}
	cout << "Другая форма for\n";
	int i = 0;
	for ( ; i < 10; ) {
		cout << i << ' ';
		++i;
	}
	cout << "\nСчет вперёд до 10\n";
	for (int i = 1; i <= 10; ++i) { // i += 2
		cout << i << ' ';
	}
	cout << "\n\nОбратный отсчёт\n";
	for (int i = 10; i >= 0; --i) {
		cout << i << ' ';
	}
	cout << "\nС шагом 5\n";
	for (int i = 0; i <= 50; i += 5) {
		cout << i << ' ';
	}
	cout << "\nВ обратном порядке с шагом 5\n";
	for (int i = 50; i >= 0; i -= 5) {
		cout << i << ' ';
	}
	cout << "\n3 столбика по 5 рядов\n";
	const int ROW = 5, COL = 3;
	for (int i = 0; i < ROW; cout << endl, ++i) {
		for (int k = 0; k < COL; ++k) {
			cout << i << ',' << k << ' ';
		}
	}
	int num = 0;
	for (num = 0; num <= 5; ++num) {
		cout << "num: " << num << endl;
		if (num == 3) { break; } // Прерывание цикла
	}
	cout << "Цикл прервался на: " << num << '\n';
	return 0;
}
// Output:
/*
Счёт вперёд до 9
0 1 2 3 4 5 6 7 8 9
0
1
2
3
4
5
6
7
8
9
Другая форма for
0 1 2 3 4 5 6 7 8 9
Счет вперёд до 10
1 2 3 4 5 6 7 8 9 10

Обратный отсчёт
10 9 8 7 6 5 4 3 2 1 0
С шагом 5
0 5 10 15 20 25 30 35 40 45 50
В обратном порядке с шагом 5
50 45 40 35 30 25 20 15 10 5 0
3 столбика по 5 рядов
0,0 0,1 0,2
1,0 1,1 1,2
2,0 2,1 2,2
3,0 3,1 3,2
4,0 4,1 4,2
num: 0
num: 1
num: 2
num: 3
Цикл прервался на: 3
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
