// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример двойного счётчика
// coutDouble.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    for (int row = 0; row < 1; ++row) {
        for (int a = 9; a >= 0; --a) {
            cout << a << ' ';
        }
        cout << endl;
        for (int b = 0; b < 10; ++b) {
            cout << b << ' ';
        }
        cout << endl;
    }
    return 0;
}
// ДЗ. a b c d и добвить задерку в 1 сек.
//     d c b a
// Output:
/*
9 8 7 6 5 4 3 2 1 0
0 1 2 3 4 5 6 7 8 9
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
