// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// программу, которая выводит таблицу умножения числа N
// в интервале от 1 до 10. Ввод всех переменных выполнять с клавиатуры.
// multiTable.cpp
// v 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    int num = 0, from = 0, to = 0;
    cout << "Введи число и диапазон от 1-10" << endl;
    cin >> num >> from >> to;
    for (int i = from; i <= to; ++i) {
        cout << num << "*" << i << "=" << num * i << endl;
    }
}
// Output
/*
Введи число и диапазон от 1-10
2
1
10
2*1=2
2*2=4
2*3=6
2*4=8
2*5=10
2*6=12
2*7=14
2*8=16
2*9=18
2*10=20
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
