// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример простой матрицы с помощью for
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
    for (int r = 1; r <= 5; ++r) {
        cout << "* ";
    }
    cout << "\n\n-=-=-=-=-=-=-=-\n\n";
    for (int r = 1; r <= 5; ++r) {
        cout << "* \n";
    }
    for (int r = 1; r <= 5; ++r) {
        cout << "* ";
    }

    cout << "\n\nПрямоугольная заполненная матрица\n\n";
    for (int r = 1; r <= 5; ++r) {
        for (int c = 1; c < 5; ++c) {
            cout << "* ";
        }
        cout << "* \n";
    }
    cout << endl;

    cout << "\n\nВозрастающая треугольная матрица\n\n";
    for (int r = 1; r <= 5; ++r) {
        for (int c = 1; c < r; ++c) {
            cout << "* ";
        }
        cout << "* \n";
    }
    cout << endl;
    cout << "\n\nУбывающая треугольная матрица\n\n";
    for (int r = 1; r <= 5; ++r) {
        for (int c = r; c < 5; ++c) {
            cout << "* ";
        }
        cout << "* \n";
    }
    cout << endl;
    cout << "\n\n1-й заполненный прямоугольный треугольник\n\n";
    for (int r = 1; r <= 5; ++r) {
        for (int c = r; c <= 5; ++c) {
            cout << ' ';
        }
        for (int c = 1; c <= r; ++c) {
            cout << "*";
        }
        cout << endl;
    }
    cout << "\n\n2-й заполненный прямоугольный треугольник\n\n";
    for (int r = 1; r <= 5; ++r) {
        for (int c = 1; c <= r; ++c) {
            cout << ' ';
        }
        for (int c = r; c <= 5; ++c) {
            cout << "*";
        }
        cout << endl;
    }
    cout << endl;
    return 0;
}
// Output:
/*
* * * * *

-=-=-=-=-=-=-=-

*
*
*
*
*
* * * * *

Прямоугольная заполненная матрица

* * * * *
* * * * *
* * * * *
* * * * *
* * * * *



Возрастающая треугольная матрица

*
* *
* * *
* * * *
* * * * *



Убывающая треугольная матрица

* * * * *
* * * *
* * *
* *
*



1-й заполненный прямоугольный треугольник

     *
    **
   ***
  ****
 *****


2-й заполненный прямоугольный треугольник

 *****
  ****
   ***
    **
     *
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//