// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Матрица чисел из рядов и столбцов
// rowCol.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <unistd.h>
using namespace std;

int main() {
    /* for (int i = 0; i < 5; sleep(1), cout << endl, ++i) {
        cout << i << ',' << ' ';
    } */
    /* for (int k = 0; k < 3; sleep(1), ++k) {
            cout << k << ' ';
			cout.flush();
    } */

    cout << "\nТри столбика по 5 рядов\n";
    for (int i = 0; i < 5; sleep(1), cout << endl, ++i) {
        for (int k = 0; k < 3; sleep(1), cout.flush(), ++k) {
            cout << i << ',' << k << ' ';
        }
    }
    return 0;
}
// Output:
/*
Три столбика по 5 рядов
0,0 0,1 0,2
1,0 1,1 1,2
2,0 2,1 2,2
3,0 3,1 3,2
4,0 4,1 4,2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
