// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Ссылки vc Указатели
// reVvsPoint.cpp
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    int value = 7;
    int *const ptr = &value; // Константный указатель
    int &ref = value;
    cout << "value " << value << '\t' << " ptr " << *ptr << '\t' << " ref " << ref << '\n';
    cout << "value " << &value << '\n' << "  ptr " << ptr << '\n' << "  ref " << &ref << '\n';
    // *ptr и &ref обрабатываются одинаково
    // "под капотом" ссылки реализованны с помощью указателей
    return 0;
}
// Output
/*
value 7  ptr 7   ref 7
value 0x7ffe861fc358
  ptr 0x7ffe861fc358
  ref 0x7ffe861fc358
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //