// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример функции вычесления площади прямоугольника
// S = a * b
// v 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример функции вычесления площади прямоугольника
// S = a * b
#include<iostream>
using namespace std;

int area() {
    int area = 50 * 60;
    return area;
}

int main() {
    int a;
    a = 10;
    int b = a;
    int sum = a + b;
    cout << "Площадь прямоугольника: " << area() << endl;
    cout << "Площадь прямоугольника: " << area() << endl;
    cout << "Площадь прямоугольника: " << area() << endl;
    cout << "Сумма a и b: " << sum << endl;

    return 0;
}
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//