// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Примеры применения многомерного массива
// 2arrMulti.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    const int ROW = 2; // Ряды (строки)
    const int COL = 5; // Колонки (столбцы)
    int arr[ROW][COL] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // arr[0-1][0-4]
    cout << arr[0][0] << ' ';
    cout << arr[0][1] << ' ';
    cout << arr[0][2] << ' ';
    cout << arr[0][3] << ' ';
    cout << arr[0][4] << '\n';
    puts("Циклом");
    for (int i = 0; i < COL; ++i) {
        cout << arr[0][i] << ' ';
    }
    cout << '\n';
    for (int k = 0; k < COL; ++k) {
        cout << arr[1][k] << ' ';
    }
    cout << '\n';
    puts("Вложенными циклами");
    for (int i = 0; i < ROW; cout << '\n', ++i) {
        for (int c = 0; c < COL; ++c) {
            cout << arr[i][c] << ' ';
        }
    }
    puts("Матрица");
    int matrix[3][5];
    for (int i = 0; i < 3; ++i) { // Заполнение массива какими-то числами
        for (int k = 0; k < 5; ++k) {
            matrix[i][k] = i + k;
        }
    }
    for (int i = 0; i < 3; cout << '\n', ++i) { // Печать на экран содержимого
        for (int k = 0; k < 5; ++k) {
            cout << matrix[i][k] << ' ';
        }
    }
    return 0;
}
// Д.З.
// Output:
/*
1 2 3 4 5
Циклом
1 2 3 4 5
5 4 3 2 1
Вложенными циклами
1 2 3 4 5
5 4 3 2 1
Матрица
0 1 2 3 4
1 2 3 4 5
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
