// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Фиксированные массивы класса array
// array.cpp Arrays/Array
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <array>
using namespace std;

int main() {
    array<int, 4> iarray {8, 6, 4, 2};
    cout << iarray[0] << endl;
    cout << "Размер массива: " << iarray.size() << '\n';
    cout << (iarray.at(0) = 1) << '\n'; // Замена содержимого индекса
    cout << iarray.at(3) << endl; // Показать содержимое индекса
    return 0;
}
// Output:
/*
8
Размер массива: 4
1
2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
