// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
//  Как можно и нельзя с многомерными фиксированными массивами
//  mayCannot.cpp Arrays
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    //int a[] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя!
    //int a[4][6] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}, {10, 9, 8}, {11, 12, 13, 14, 15, 16, 17}}; // Так нельзя!
    // В примере выше указано меньшее количество столбцов (2-е измерение)
    //int a[0][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Так нельзя!
    //int a[3][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}}; // Допустимо
    //int a[][5] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}, {10, 9, 8}}; // Допустимо
    //int a[][6] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1}, {10, 11, 12}, {10, 11, 12}, {10, 11, 12, 13, 14, 15}}; // Допустимо
    //cout << a << endl;
    //int barr[][2][3]{{{1, 2, 0}}, {{2, 1, 0}}, {{3, 4, 0}}}; // Допустимо
    int arr[][8] {{1, 2, 3, 4, 5}, {5, 4, 3, 2, 1, 0, -1, -2}, {18}, {15}};
    cout << arr << endl;
    cout << arr[0][0] << endl; // 1-я строка 0-й столбец
    cout << arr[1][6] << endl; // 2-я строка 6-й столбец
    cout << arr[2][0] << endl; // 3-я строка 0-й столбец
    cout << arr[3][0] << endl; // 4-я строка 0-й столбец
    //cout << arr[5][12] << endl; // Переполнение! Так делать нельзя
    cout << "Арифметика многомерного массива\n";
    cout << "arr[0][1] + arr[0][2] = " << arr[0][1] + arr[0][2] << endl;
    cout << "arr[0][1] + arr[1][3] = " << arr[0][1] + arr[1][3] << endl;
    cout << "arr[0][1] + arr[2][0] = " << arr[0][1] + arr[2][0] << endl;
    int barr[][1][4]{{{1, 2, 0, -1}}, {{20, 10, 50}}, {{30, 40, 60}}, {{33, 44, 70}}, {{31, 41, 11}}}; //
    cout << barr[0][1][0] << endl; // 20. Но так лучше не делать
    cout << barr[0][1][1] << endl; // 10. Но так лучше не делать
    cout << barr[0][1][2] << endl; // 50. Но так лучше не делать
    cout << barr[0][2][0] << endl; // 30. Но так лучше не делать
    //cout << barr << endl;
    return 0;
}
// Output:
/*
0x7ffe37556f80
1
-1
18
15
Арифметика многомерного массива
arr[0][1] + arr[0][2] = 5
arr[0][1] + arr[1][3] = 4
arr[0][1] + arr[2][0] = 20
20
10
50
30
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
