// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Булевый тип данных. Логические оператора
// logic.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << boolalpha;
    bool a = 1, b = 0;
    cout << "Логические операторы\n";
    cout << "and и && это логическое И\n"; // Коньюнкция
	cout << "(a and b) = " << (a and b) << endl;
    cout << "(a && b) = " << (a && b) << endl;
    cout << "or и || это логическое ИЛИ\n"; // Дизъюнкция
    cout << "(a or b) = " << (a or b) << endl;
    cout << "(a || b) = " << (a || b) << endl;
    cout << "(a == b) = " << (a == b) << endl; // Равенство
    cout << "not_eq и != это логическое НЕРАВЕНСТВО\n";
    cout << "(a not_eq b) = " << (a not_eq b) << endl; // Не равенство
    cout << "(a != b) = " << (a != b) << endl;
    cout << "not и ! это логическое НЕ\n";
    cout << "(not a) " << (not a) << '\t' << "(not b )" << (not b) << endl;
    cout << "(!a) " << (!a) << '\t' << "(!b)" << (!b) << endl;
    return 0;
}
// Output
/*
Логические операторы
and и && это логическое И
(a and b) = false
(a && b) = false
or и || это логическое ИЛИ
(a or b) = true
(a || b) = true
(a == b) = false
(a != b) = true
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//