// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
// Как поменять значение 2-х переменных без использования 3-й
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-= -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
#include <iostream>
using namespace std;

int main() {
    short num1 = 2;
    short num2 = 33;
    num1 = num1 xor num2; // ^
    num2 = num1 xor num2;
    num1 = num1 xor num2;
    cout << "num1: " << num1 << " num2: " << num2 << endl;
    return 0;
}
/*
num1: 33 num2: 2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//