// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример вычисления равенства с помощью возвращения логического значения
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

bool isEqual(int x, int y) {
    return (x == y);
}

int main() {
    cout << "Введите 1-е число: ";
    int firstNum = 0;
    cin >> firstNum;
    cout << "Введите 2-е число: ";
    int secondNum = 0;
    cin >> secondNum;
    cout << boolalpha;
    isEqual(firstNum, secondNum) ? cout << "Равны" : cout << "Не равны";

    return 0;
}
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//