// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример использования логических значений
// При каких условиях можно поплавать?
// swimming.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
  cout << boolalpha;
  bool waterCold; // Вода холодная
  bool swim = true; // Я плаваю
  cout << "Вода холодная? (1 - да, 0 - нет)" << endl;
  cin >> waterCold;
  cout << (!waterCold && swim) << "\n";
  /*
  11 - я не плаваю (false)
  01 - я плаваю (true)
  */
  return 0;
}
// Output
/*
Вода холодная? (1 - да, 0 - нет)
0
true
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
