// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример использования логических операторов
// swimming.cpp Bools
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    cout << boolalpha;
    bool waterCold; // Вода холодная
    const bool SWIM = true; // Я плаваю
    cout << "Вода холодная? (1 - да, 0 - нет)\n";
    cin >> waterCold;
    cout << "Я плавую? " << (!waterCold && SWIM) << '\n';
    return 0;
}
// Output:
/*
Вода холодная? (1 - да, 0 - нет)
3
Я плавую? false
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//