// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Напишите программу, которая выводит на экран числа
// от 1 до 50, пропуская каждые 5-ки. Например 1, 2, 3, 4, 6, 7….13, 14, 16 и т.д.
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    for (int i = 1; i <= 50; ++i) {
      if (i % 5 == 0) {
        continue; // Прыжок из цикла
      }
      cout << i;
    }
    cout << endl;
    return 0;
}
// Output:
/*
123467891112131416171819212223242627282931323334363738394142434446474849
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
