// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Напишите интерактивную программу, которая в цикле генерирует от 0 до 3
// случайное целое число и предлагает пользователю его угадать.
// guessNumCycle.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() {
    srand(time(0));
    char again = 'y';
    int userNum = 0;
    while (again == 'y') {
        cout << "Угадай число!\n";
        int secret = 0 + (rand() % 3);
        cin >> ws >> userNum;
        cout << (userNum != secret ? "Не угадал!" : "Угадал!") << endl;
        cout << "Ещё? y/n\n";
        cin >> ws >> again;
    }
    return 0;
}
// Output:
/*
Угадай число!
1
Угадали!
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//