// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Задержка в секундах без проверок time()
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

void WaitSec(int n);

int main() {
    int delay = 3;
    WaitSec(delay);
    cout << "Delay " << delay << " seconds" << endl;

    return 0;
}

void WaitSec(int n) {
    time_t t1, t2; /* это знаковый тип, считай long int */
    time(&t1);     /* в переменную t1 помещается количество секунд с 00:00:00 01.01.1970 */
    do {
        time(&t2); /* в переменную t2 помещается количество секунд ... */
    }
    while ((int)difftime(t2, t1) <= n);
    /* difftime возвращает double, из t2 вычитает t1
       double по ходу для того, чтобы большие значения возвращать */
}
// Output:
/*
Delay 3 seconds
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//