// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример использования static для генерации уникальных ID
// уничтожения временных переменных
// generatorID.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int generateID() {
    static int s_itemID = 0; // s в имени переменной указывают на статичную переменную
    // Если не указать static, то переменная не будет работать в called (main())
    return ++s_itemID;
}

int main() {
    int i = 0;
    while (i < 10) {
      ++i;
      cout << generateID() << endl;
    }
    return 0;
}
// Output:
/*
1
2
3
4
5
6
7
8
9
10
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
