// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Функция проверки чётности числа
// even.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

bool isEven(int x) {
    return (x % 2) == 0;
}

int main() {
    cout << "Введите целое число: \n";
    int num;
    cin >> ws >> num;
    cout << boolalpha << isEven(num) << endl;
    return 0;
}
// Output
/*
Введите целое число:
5
false
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
