// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Простой пример инкремента/декремента
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
using namespace std;

int main() {
    int i = 5;
    // Преинкремент - лучший вариант
    cout << ++i << endl; // Инкремент это - увеличение значения на 1
    cout << ++i << endl; // i = i + 1
    cout << ++i << endl;
    cout << --i << endl; // Декремент - это уменьшение на 1
    cout << --i << endl; // i = i - 1
    // Постинкремент
    cout << i++ << endl; // Постинкремент
    cout << i-- << endl; // Постдекремент
    ++i;
    cout << "i: " << i << endl;
    int x = 6;
    --x;
    cout << "x: " << x << endl;
    return 0;
}

/* Output:
6
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//