// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Многомерные векторы
// V 1.0 beta
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <iostream>
#include <vector>
using namespace std;

int main() {
    vector<vector<int>> nums  {{1, 2, 3, 4}, {5, 6, 7, 8}};
    cout << nums[1].at(3) << endl; // 1 - вестор строк, 3 - вектор элементов
    cout << "Размер вектора: " << nums[0].size() << endl;
    cout << nums.size() << '\n';
    cout << nums[0].size() + nums[1].size() << '\n';
    cout << &nums << '\n';
    return 0;
}
// Output:
/*
8
Размер вектора: 4
2
8
0x7ffd541d0a30
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
