// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Арифметика в C++. Продолжение
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- 
#include<iostream>
#include<cmath>
using namespace std;

int main() {
    float a = 7;
    float b = 2;
    cout << a / b << "\n";
    cout << "-=-=-=-=-=-=-=-=-=-=-=-" << "\n";
    int c = -12, e = -10;
    cout << (c - 1) << "\n";
    cout << (c + 1) << "\n";
    cout << c + e << "\n";
    cout << c * e << "\n";
    cout << c / e << "\n";
    cout << "Возведение в степень" << "\n";
    cout << (pow(5, 2)) << endl;
    return 0;
}

// Output
/*
3.5
-=-=-=-=-=-=-=-=-=-=-=-
-13
-11
-22
120
1
us
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-