// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Примеры строк, работы с ними, а так же элементарная арифметика
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include<iostream>
#include<unistd.h>

using namespace std;

int main() {
    cout << boolalpha;
    char strAlex[] = {"Alex"};
    char strProg[] = {" Programmer"};
    cout << strAlex << "\t" << strProg << endl;
    cout << (sizeof(strProg) / sizeof(strProg[0])) << "\n";
    cout << "-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
    string strAlexString = "Алекс";
    string strAlexProgramString = " программист";
    cout << strAlexString + strAlexProgramString << "\n";
    cout << "-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
    int a = 5, b = 6;
    int result = a + (b - 3);
    cout << result  << "\n";
    cout << "-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
    int aa = 5, bb = 6;
    int res = aa * bb;
    cout << "Результат вычисления aa * bb = " << res << "\n";
    int aaa = 12, bbb = 2;
    int devision = aaa / bbb;
    cout << "Результат деления aaa / bbb = " << devision << "\n";
    int val = 6 + 5 - (1 * (5 / 2));
    cout << val << "\n";
    cout << "-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
    int a2 = 5, b2 = 6;
    cout << (a2 += b2) << endl; // a2 = a2 + b2;
    cout << (a2 -= b2) << "\n";
    cout << (a2 *= b2) << "\n";
    cout << (a2 /= b2) << "\n";
    cout << "Целое число? " << ((23 % 2 == 0) ? true : false ) << "\n";
    int num = 124565463;
    cout << num % 10 << endl; // Деление с остатком 10
    sleep(2);
    cout << "Сигнал с задержкой" << "\7" << endl;
    return 0;
}
// Output:
/*
Alex     Programmer
12
-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
Алекс программист
-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
8
-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
Результат вычисления aa * bb = 30
Результат деления aaa / bbb = 6
9
-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
11
5
30
5
Целое число? false
Сигнал с задержкой
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//