// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
// Интерактивная программа, которая остаток лет до 100
// old100.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-= -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
#include <iostream>
using namespace std;

int main() {
    cout << "Сколько вам лет?\n";
    short age = 0;
    cin >> age;
    unsigned result = 100 - age;
    cout << "До 100 лет вам осталось: " << result << '\n';
    return 0;
}
// OUTPUT
/*
Сколько вам лет?
101
До 100 лет вам осталось: 4294967295
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//