// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
// replase.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-= -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
#include <iostream>
using namespace std;

int main() {
    short num1 = 7;
    short num2 = 58;
    // Нужно поменять местами значения 2-х переменных
    num1 = num1 + num2; // 7 +58
    num2 = num1 - num2; //
    num1 = num1 - num2; //
    cout << "num1: " << num1 << " num2: " << num2 << '\n';
    return 0;
}
// OUTPUT
/*
num1: 5 num2: 2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//