// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
// Нахождение суммы натуральных чисел
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-= -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
#include <iostream>
using namespace std;

int main() {
    cout << "Вычисление суммы натуральных чисел\n";
    int num = 0, sum = 0;
    cin >> num;
    sum = num * (num + 1) / 2;
    cout << "Сумма натуральных чисел: " << sum << "\n";
    // 6 = 1 + 2 + 3
    return 0;
}
// OUTPUT
/*
5
Сумма натуральных чисел: 15
*/
// 1 + 2 + 3 + 4 + 5 = 15
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//