// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Программа, которая переводит секунды в минуты и часы
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include<iostream>
using namespace std;

int main() {
    int sec = 0, hour = 0, min = 0;
    cout << "Введите количество секунд: ";
    cin >> sec;
    hour = sec / 3600; // В 60 минутах 3600 секунд
    sec -= hour * 3600;
    min = sec / 60;
    sec -= min * 60;
    cout << hour << " hour " << min << " min " << sec << " sec" << "\n";
    return 0;
}
// Output
/*

*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-