//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Сортировка элементов массива случайным образом
// V 1.0
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include <iostream>
#include <algorithm>

using namespace std;
int main() {
  srand(time(0));
  short LENGTH = 10;
  int arr[LENGTH];
  // Заполняем массив числами от 1 до 10
  for (int i = 0; i < LENGTH; ++i) {
    arr[i] = i+1;
  }
  cout << "Массив до сортировки случайным образом\n";
  for (auto i : arr) {
    cout << i << ' ';
  }
  cout << "\nМассив после сортировки\n";
  std::random_shuffle(arr, arr + LENGTH);
  for (auto i : arr) {
    cout << i << ' ';
  }
  cout << endl;
  return 0;
}
// Output
/*
Массив до сортировки случайным образом
1 2 3 4 5 6 7 8 9 10
Массив после сортировки
1 5 10 9 4 6 3 8 7 2
*/
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// End file
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
