//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// Сортировка элементов массива случайным образом
// V 1.0
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
#include <iostream>
#include <algorithm>

using namespace std;
int main() {
    srand(time(0));
    short LENGTH = 10;
    int arr[LENGTH];
    // Заполняем массив числами от 1 до 10
    for (int i = 0; i < LENGTH; ++i) {
        arr[i] = i + 1;
    }
    cout << "Массив до сортировки\n";
    for (auto i : arr) {
        cout << i << ' ';
    }
    cout << "\nМассив после сортировки случайным образом\n";
    std::random_shuffle(arr, arr + LENGTH);
    for (auto i : arr) {
        cout << i;
        cin.get(); // Enter
    }
    return 0;
}
// Output
/*
Массив до сортировки
1 2 3 4 5 6 7 8 9 10
Массив после сортировки случайным образом
9
1
4
8
2
6
7
3
5
10
*/
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
// End file
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
