// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=--=-=-=-=-//
// Факториал с помощью рекурсии
// factorialSimply.cpp
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-//
#include <iostream>
#include <unistd.h>
using namespace std;

int fact(int n) {
    int f = 1;
    cout << "Шаги: " << n << endl;
    sleep(1);
    if (n > 1) {
        f = n * fact(n - 1); // 6*(6*5*4*3*2*1) = 720, 6!=6*(6–1)!
    }
    cout << "Результат вычсления: " << f << endl;
    sleep(1);
    return f;
}

int main() {
    fact(5);
    return 0;
}
// Output:
/*
Шаги: 5
Шаги: 4
Шаги: 3
Шаги: 2
Шаги: 1
Результат вычсления: 1
Результат вычсления: 2
Результат вычсления: 6
Результат вычсления: 24
Результат вычсления: 120
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//